## 靜態NAT

![image]()

R4 (Server)
```
R4(config)#int e0/0
R4(config-if)#ip addr 24.1.1.4 255.255.255.0
R4(config-if)#no shut
R4(config-if)#exit
R4(config)#ip route 0.0.0.0 0.0.0.0 24.1.1.2
R4(config)#line vty 0 4
R4(config-line)#password 123
R4(config-line)#login
R4(config-line)#transport input telnet
```
R2 邊緣路由器
```
R2(config)#int e0/0
R2(config-if)#ip addr 12.1.1.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#int e0/1
R2(config-if)#ip addr 23.1.1.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#int e0/2
R2(config-if)#ip addr 24.1.1.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#exit
R2(config)#do telnet 24.1.1.4
Trying 24.1.1.4 ... Open


User Access Verification

Password:
R4>
```
R3 外網路由器
```
R3(config)#int e0/0
R3(config-if)#ip addr 23.1.1.3 255.255.255.0
R3(config-if)#no shut
```
R2
```
R2(config)#int e0/2
R2(config-if)#ip nat inside
R2(config-if)#int e0/1
R2(config-if)#ip nat outside
R2(config-if)#exit
R2(config)#ip nat inside source static tcp 24.1.1.4 23 23.1.1.2 23
R2(config)#do sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
tcp 23.1.1.2:23        24.1.1.4:23        ---                ---
```
R3
```
R3#telnet 23.1.1.2
Trying 23.1.1.2 ... Open

User Access Verification

Password:
R4>
```

## 冗餘協定

Test1

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211228/FHRP-1.jpg)

R3(Client)
```
Client(config)#int e0/0
Client(config-if)#ip addr 192.168.125.10 255.255.255.0
Client(config-if)#no shut
Client(config-if)#ip default--gateway 192.168.125.3
Client(config)#do sh ip route
Default gateway is 192.168.125.3

Host               Gateway           Last Use    Total Uses  Interface
ICMP redirect cache is empty
```
R4
```
R4(config)#int e0/0
R4(config-if)#ip addr 14.1.1.4 255.255.255.0
R4(config-if)#no shut
R4(config-if)#int e0/1
R4(config-if)#ip addr 24.1.1.4 255.255.255.0
R4(config-if)#no shut
R4(config-if)#int lo1
R4(config-if)#ip addr 4.4.4.4 255.255.255.0
R4(config-if)#no shut
R4(config-if)#router rip
R4(config-router)#version 2
R4(config-router)#no auto-summary
R4(config-router)#network 14.1.1.0
R4(config-router)#network 24.1.1.0
R4(config-router)#network 4.4.4.0
```
R1
```
R1(config)#int e0/0
R1(config-if)#ip addr 192.168.125.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#int e0/1
R1(config-if)#ip addr 14.1.1.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 14.1.1.0
R1(config-router)#network 192.168.125.0

R1(config)#int e0/0
R1(config-if)#standby 1 ip 192.168.125.3
R1(config-if)#standby 1 priority 120
R1(config-if)#do sh ip arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  14.1.1.1                -   aabb.cc00.0110  ARPA   Ethernet0/1
Internet  14.1.1.4                4   aabb.cc00.0400  ARPA   Ethernet0/1
Internet  192.168.125.1           -   aabb.cc00.0100  ARPA   Ethernet0/0
Internet  192.168.125.2           0   aabb.cc00.0200  ARPA   Ethernet0/0
Internet  192.168.125.3           -   0000.0c07.ac01  ARPA   Ethernet0/0
R1(config-if)#do sh ip arp
R1(config-if)#do sh standby
Ethernet0/0 - Group 1
  State is Active
    2 state changes, last state change 00:00:12
  Virtual IP address is 192.168.125.3
  Active virtual MAC address is 0000.0c07.ac01
    Local virtual MAC address is 0000.0c07.ac01 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.664 secs
  Preemption disabled
  Active router is local
  Standby router is unknown
  Priority 120 (configured 120)
  Group name is "hsrp-Et0/0-1" (default)

```
R2
```
R2(config)#int e0/0
R2(config-if)#ip addr 192.168.125.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#int e0/1
R2(config-if)#ip addr 24.1.1.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#router rip
R2(config-router)#version 2
R2(config-router)#no auto-summary
R2(config-router)#network 24.1.1.0
R2(config-router)#network 192.168.125.0

R2(config-router)#int e0/0
R2(config-if)#standby 1 ip 192.168.125.3
R2(config-if)#do sh ip arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  24.1.1.2                -   aabb.cc00.0210  ARPA   Ethernet0/1
Internet  24.1.1.4                1   aabb.cc00.0410  ARPA   Ethernet0/1
Internet  192.168.125.1           1   aabb.cc00.0100  ARPA   Ethernet0/0
Internet  192.168.125.2           -   aabb.cc00.0200  ARPA   Ethernet0/0

R2(config-if)#do sh ip standby
Router(config-if)#do sh standby
Ethernet0/0 - Group 1
  State is Standby
    1 state change, last state change 00:00:02
  Virtual IP address is 192.168.125.3
  Active virtual MAC address is 0000.0c07.ac01
    Local virtual MAC address is 0000.0c07.ac01 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.592 secs
  Preemption disabled
  Active router is 192.168.125.1, priority 120 (expires in 10.080 sec)
  Standby router is local
  Priority 100 (default 100)
  Group name is "hsrp-Et0/0-1" (default)

```
R1 int e0/0 no shut
R3
```
client#traceroute 4.4.4.4
Type escape sequence to abort.
Tracing the route to 4.4.4.4
VRF info: (vrf in name/id, vrf out name/id)
  1 192.168.125.1 1007 msec 2 msec 1 msec
  2 14.1.1.4 1 msec 1 msec *

```
R1 int e0/0 shut
R3
```
//R1
R1(config-if)#int e0/0
R1(config-if)#shut

//R3
client#traceroute 4.4.4.4
Type escape sequence to abort.
Tracing the route to 4.4.4.4
VRF info: (vrf in name/id, vrf out name/id)
  1 192.168.125.2 1 msec 1 msec
  2 24.1.1.4 1 msec 1 msec *

```

Test2

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211228/FHRP-2.jpg)

R6 Client2
```
Client2(config)#no ip routing
Client2(config)#int e0/0
Client2(config-if)#ip addr 192.168.126.10 255.255.255.0
Client2(config-if)#no shut
Client2(config-if)#ip default-gateway 192.168.126.3
Client2(config)#do sh ip route
Default gateway is 192.168.126.3

Host               Gateway           Last Use    Total Uses  Interface
ICMP redirect cache is empty

```
R1
```
R1(config-if)#int e0/0
R1(config-if)#ip addr 192.168.126.1 255.255.255.0 secondary
R1(config-if)#do sh ip int
Ethernet0/0 is up, line protocol is up
  Internet address is 192.168.125.1/24
  Broadcast address is 255.255.255.255
  Address determined by setup command
  MTU is 1500 bytes
  Helper address is not set
  Directed broadcast forwarding is disabled
  Secondary address 192.168.126.1/24
  .
  .
R1(config-if)#standby 2 ip 192.168.126.3
R1(config-if)#standby 2 priority 100
R1(config-if)#standby 1 preempt
R1(config-if)#do sh standby
Ethernet0/0 - Group 1
  State is Active
    7 state changes, last state change 00:00:04
  Virtual IP address is 192.168.125.3
  Active virtual MAC address is 0000.0c07.ac01
    Local virtual MAC address is 0000.0c07.ac01 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.992 secs
  Preemption enabled
  Active router is local
  Standby router is unknown
  Priority 120 (configured 120)
  Group name is "hsrp-Et0/0-1" (default)
Ethernet0/0 - Group 2
  State is Standby
    2 state changes, last state change 00:00:35
  Virtual IP address is 192.168.126.3
  Active virtual MAC address is 0000.0c07.ac02
    Local virtual MAC address is 0000.0c07.ac02 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.008 secs
  Preemption disabled
  Active router is local
  Standby router is unknown
  Priority 100 (default 100)
  Group name is "hsrp-Et0/0-2" (default)

R1(config)#router rip
R1(config-router)#network 192.168.126.0

```
R2
```
R2(config)#int e0/0
R2(config-if)#ip addr 192.168.126.2 255.255.255.0 secondary
R2(config-if)#do sh ip int
Ethernet0/0 is up, line protocol is up
  Internet address is 192.168.125.2/24
  Broadcast address is 255.255.255.255
  Address determined by setup command
  MTU is 1500 bytes
  Helper address is not set
  Directed broadcast forwarding is disabled
  Secondary address 192.168.126.2/24
  .
  .
R2(config-if)#standby 2 ip 192.168.126.3
R2(config-if)#standby 2 priority 120
R2(config-if)#standby 2 preempt
R2(config-if)#do sh standby
Ethernet0/0 - Group 1
  State is Standby
    4 state changes, last state change 00:02:55
  Virtual IP address is 192.168.125.3
  Active virtual MAC address is 0000.0c07.ac01
    Local virtual MAC address is 0000.0c07.ac01 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.472 secs
  Preemption disabled
  Active router is 192.168.125.1, priority 120 (expires in 9.600 sec)
  Standby router is local
  Priority 100 (default 100)
  Group name is "hsrp-Et0/0-1" (default)
Ethernet0/0 - Group 2
  State is Active
    1 state change, last state change 00:00:05
  Virtual IP address is 192.168.126.3
  Active virtual MAC address is 0000.0c07.ac02
    Local virtual MAC address is 0000.0c07.ac02 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.416 secs
  Preemption enabled
  Active router is local
  Standby router is unknown
  Priority 120 (configured 120)
  Group name is "hsrp-Et0/0-2" (default)
  
R2(config)#router rip
R2(config-router)#network 192.168.126.0

```
R6、R3
```
//R6
Client2>traceroute 4.4.4.4
Type escape sequence to abort.
Tracing the route to
VRF info: (vrf in name/id, vrf out name/id)
  1 192.168.125.2 1 msec 1 msec 0 msec
  2 24.1.1.4 1 msec 1 msec *

//R3
client#traceroute 4.4.4.4
Type escape sequence to abort.
Tracing the route to 4.4.4.4
VRF info: (vrf in name/id, vrf out name/id)
  1 192.168.125.1 1 msec 1 msec 1 msec
  2 14.1.1.4 1 msec 1 msec *

```

