## Trunk
* ISL(Cisco)
* 802.1q (IEEE)
*  Switch和Switch之間

### Test1

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/test1.jpg)


#### SW設定vlan
```
//SW1
sw1(config)#vlan 10
sw1(config-vlan)#name vlan10
sw1(config-vlan)#exit
sw1(config)#vlan 20
sw1(config-vlan)#name vlan20

sw1(config-vlan)#int e0/0
sw1(config-if)#sw mode access
sw1(config-if)#sw access vlan 10
sw1(config-if)#int e0/1
sw1(config-if)#sw mode access
sw1(config-if)#sw access vlan 20

//SW2
sw2(config)#vlan 10
sw2(config-vlan)#name vlan10
sw2(config-vlan)#exit
sw2(config)#vlan 20
sw2(config-vlan)#name vlan20

sw2(config-vlan)#int e0/0
sw2(config-if)#sw mode access
sw2(config-if)#sw access vlan 10
sw2(config-if)#int e0/1
sw2(config-if)#sw mode access
sw2(config-if)#sw access vlan 20
```

#### PC設定IP
```
//PC1
VPC3> ip 192.168.10.1 255.255.255.0

//PC2
VPC4> ip 192.168.20.1 255.255.255.0

//PC3
VPC5> ip 192.168.10.2 255.255.255.0

//PC4
VPC6> ip 192.168.20.2 255.255.255.0
```

#### SW設定trunk
```
//SW1
sw1(config)#int e0/2
sw1(config-if)#switchport trunk encapsulation dot1q       //封裝格式
sw1(config-if)#switchport mode trunk

//SW2
sw2(config)#int e0/2
sw2(config-if)#switchport trunk encapsulation dot1q
sw2(config-if)#switchport mode trunk
sw2(config-if)#do sh interface trunk
```

#### PC1 ping PC3

![image]()

![image]()


### Test2
* native vlan 1 改成vlan 10

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/test1.jpg)

#### PC5、PC6 設定IP
```
//PC5
VPC7> ip 192.168.0.1 255.255.255.0

//PC6
VPC8> ip 192.168.0.2 255.255.255.0
```

#### SW設定vlan
```
//SW1
sw1(config)#int e0/2
sw1(config-if)#switchport trunk native vlan 10

//SW2
sw2(config)#int e0/2
sw2(config-if)#switchport trunk native vlan 10
sw2(config-if)#do sh inter trunk
```

#### 結果

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/1123-3.jpg)


## VTP(VLAN Trunking Protocol)-虛擬區域網路中繼協定
* 針對VLAN做全局管理
* VTP Server新增VLAN，VLAN資訊就會自動發佈到其他台Switch，其他Switch就會新增此VLAN
* sw之間的線路一定要是trunk

### VTP Mode

Server：能創建、修改、刪除 VLAN

Client：不能創建、修改、刪除 VLAN，但能學習轉發

Transparent：能創建、修改、刪除 VLAN，不能學習轉發

### Test1-VTP Server可以增減VLAN，VTP Client不能自行更改

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/vtp-1.jpg)

#### SW設定trunk
```
//SW1(Server)
sw1(config-vlan)#int e0/0
sw1(config-if)#switchport trunk encapsulation dot1q
sw1(config-if)#switchport mode trunk

//SW2(Client)
sw2(config)#int e0/0
sw2(config-if)#switchport trunk encapsulation dot1q
sw2(config-if)#switchport mode trunk
```


#### SW設定domain
SW1(Server)
```
sw1(config)#vtp domain domain1
sw1(config)#vtp password 123
sw1(config)#do show vtp status
```

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/domain-1.jpg)

SW2(Client)
```
sw2(config)#vtp domain domain1
sw2(config)#vtp password 123
sw2(config)#vtp mode client 
sw2(config)#do sh vtp status
```

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/domain-2.jpg)

#### SW1創造vlan
```
sw1(config)#vlan 10
sw1(config-vlan)#name vlan10
sw1(config-vlan)#exit
sw1(config)#vlan 30
sw1(config-vlan)#name vlan30
sw1(config-vlan)#do sh vlan br 
```

#### 結果
SW2自動增加 vlan10、vlan30

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/vlan10%E3%80%8130.jpg)


### Test2-Transparent
* 更改SW2的Mode
* 新增SW3

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/vtp-2.jpg)

延續上一個實驗環境

#### SW設定trunk、domain

```
//SW3
sw3(config)#vtp mode client
sw3(config)#vtp domain domain1
sw3(config)#vtp password 123

sw3(config)#int e0/0
sw3(config-if)#switchport trunk encapsulation dot1q
sw3(config-if)#switchport mode trunk

//SW2
sw2(config)#vtp mode transparent

sw2(config)#int e0/1
sw2(config-if)#switchport trunk encapsulation dot1q
sw2(config-if)#switchport mode trunk
```

#### 結果
SW2(transparent)新增vlan
```
sw2(config-vlan)#vlan 11
sw2(config-vlan)#name vlan11
sw2(config-vlan)#do sh vlan br
```

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw2-1.jpg)

SW1(server)沒有影響

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw1-1.jpg)

SW3(client)沒有影響

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw3-1.jpg)

-----
SW1(server)新增vlan
```
sw1(config-vlan)#vlan 20
sw1(config-vlan)#name vlan20
sw1(config-vlan)#do sh vlan br
```

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw1-2.jpg)

SW2(transparent)沒有影響

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw2-2.jpg)

SW3(client)有影響

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/sw3-2.jpg)

#### 結論

假設在一個現有的網路，有一台新的交換機放在網路上，它預設是server，如果直接放進去就會影響原本狀態，
所以就可以改成transparent mode。


### Test3-在特殊情況下，client端可以影響server端
所有設定完成下，vtp server突然斷開，然後sw2(client)就變成server，可以新增、刪除、修改，做完了就變成回client，再把線路裝好。

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/vtp-1.jpg)

SW1(Server)斷掉
```
sw1(config)#int e0/0
sw1(config-if)#shut
```
SW2(Client->Server->Client)
```
//變成server
sw2(config)#vtp mode server

//新增
sw2(config-vlan)#vlan 30
sw2(config-vlan)#name vlan30

//刪除
sw2(config-vlan)#no vlan 20

//變成client
sw2(config)#vtp mode client
```
SW1(Server)連接上
```
sw1(config)#int e0/0
sw1(config-if)#no shut
```

![image](https://github.com/zixxizxx/Liux-note/blob/main/110-1%20Cisco/image/20211123/1123-5.jpg)
