## 介紹
Layer2-switch:VLAN、LAN、STP
switch:插電後就可以直接使用
Layer3-router:RIP、OSPF、EIGRP
router:須設定後才能使用
## EVE-Pro
* terminal：
    帳號：root
    密碼：eve
* 網頁:
    帳號：admin
    密碼：eve
* 如果授權到期，就更改日期
```
# date -s 2018-01-01
```
### pc通訊-switch
手動設ip
![image]()

pc2
```
> ip 192.168.1.1
```
pc3
```
> ip 192.168.1.2
> show ip
> ping 192.168.1.1
```

![image]()

### pc通訊-router

![image]()

R1
```
//全居mode
# conf terminal
//設定e0/0介面的ip
# interface ethernet0/0
# ip address 192.168.10.254 255.255.255.0
# no shutdown
# exit
//設定e0/1介面的ip
# interface ethernet0/1
# ip address 192.168.20.254 255.255.255.0
# no shutdown
# exit

# do sh ip int br 
```
pc6
```
     //ip          //遮罩        //gateway
> ip 192.168.10.1 255.255.255.0 192.168.10.254
> show ip
```
pc7
```
> ip 192.168.20.1 255.255.255.0 192.168.20.254
> show ip
> ping 192.168.10.1
```

![image]()

